In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/008.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

,0,1,2,3,4,5
0,NaN,NaN,NaN,"Cox (R) 1,257,236","Majette (D) 734,702","Chastain (Lib) 106,215"
1,NaN,NaN,NaN,59.9%,35.0%,5.1%
2,County,PR,TP,NaN,NaN,NaN
3,APPLING,19,19,2736,1156,132
4,ATKINSON,6,6,931,456,51

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4    5
3   APPLING  19  19  2736  1156  132
4  ATKINSON   6   6   931   456   51
5     BACON   7   7  1527   636   74
6     BAKER   7   7   508   418   24
7   BALDWIN  16  16  5376  4173  346

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4    5
3   APPLING  2736  1156  132
4  ATKINSON   931   456   51
5     BACON  1527   636   74
6     BAKER   508   418   24
7   BALDWIN  5376  4173  346

In [9]:
df.columns = ['county', 'Kathy Cox', 'Denise Majette', 'David Chastain']

In [10]:
df.tail(5)

        county Kathy Cox Denise Majette David Chastain
157  WHITFIELD     11857           3945            688
158     WILCOX      1236            643             60
159     WILKES      1578           1019             90
160  WILKINSON      1457           1253             85
161      WORTH      3461           1343            144

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county  candidate votes
0   APPLING  Kathy Cox  2736
1  ATKINSON  Kathy Cox   931
2     BACON  Kathy Cox  1527
3     BAKER  Kathy Cox   508
4   BALDWIN  Kathy Cox  5376

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 477 entries, 0 to 476
Data columns (total 3 columns):
county       477 non-null object
candidate    477 non-null object
votes        477 non-null int64
dtypes: int64(1), object(2)
memory usage: 11.3+ KB

In [16]:
df['office'] = 'State School Superintendent'

In [17]:
df['district'] = ''

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Kathy Cox', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Denise Majette', 'party'] = 'Democrat'
df.loc[df['candidate'] == 'David Chastain', 'party'] = 'Libertarian'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate       party
David Chastain  Libertarian     106215
Denise Majette  Democrat        734702
Kathy Cox       Republican     1257236
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,State School Superintendent,,Republican,Kathy Cox,2736
1,ATKINSON,State School Superintendent,,Republican,Kathy Cox,931
2,BACON,State School Superintendent,,Republican,Kathy Cox,1527
3,BAKER,State School Superintendent,,Republican,Kathy Cox,508
4,BALDWIN,State School Superintendent,,Republican,Kathy Cox,5376

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')